tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf46j11_tdd.h
#define PC2                           522
#define AN7                           523
#define CCP10                         524
#define PB2                           525
#define PMPCS                         526
#define CS                            527
#define RE2                           528
#define REPU                          529
#define CCP6E                         530
#define RE6                           531
#define PB1E                          532
#define RDPU                          533
#define CCP2E                         534
#define PA2E                          535
#define RE7                           536
#define HLVDCON                       537
#define HLVDL                         538
#define HLVDL0                        539
#define HLVDL1                        540
#define HLVDL2                        541
#define HLVDL3                        542
#define HLVDEN                        543
#define IRVST                         544
#define BGVST                         545
#define VDIRMAG                       546
#define DMACON2                       547
#define INTLVL0                       548
#define INTLVL                        549
#define INTLVL1                       550
#define INTLVL2                       551
#define INTLVL3                       552
#define DLYCYC                        553
#define DLYCYC0                       554
#define DLYCYC1                       555
#define DLYCYC2                       556
#define DLYCYC3                       557
#define DMACON1                       558
#define DMAEN                         559
#define DLYINTEN                      560
#define DUPLEX0                       561
#define DUPLEX1                       562
#define RXINC                         563
#define TXINC                         564
#define SSCON0                        565
#define SSCON1                        566
#define LATA                          567
#define LATA0                         568
#define LA0                           569
#define LATA1                         570
#define LA1                           571
#define LATA2                         572
#define LA2                           573
#define LATA3                         574
#define LA3                           575
#define LATA5                         576
#define LA5                           577
#define LATA6                         578
#define LA6                           579
#define LATA7                         580
#define LA7                           581
#define LATB                          582
#define LB0                           583
#define LATB0                         584
#define LB1                           585
#define LATB1                         586
#define LB2                           587
#define LATB2                         588
#define LB3                           589
#define LATB3                         590
#define LB4                           591
#define LATB4                         592
#define LB5                           593
#define LATB5                         594
#define LB6                           595
#define LATB6                         596
#define LB7                           597
#define LATB7                         598
#define LATC                          599
#define LATC0                         600
#define LC0                           601
#define LATC1                         602
#define LC1                           603
#define LATC2                         604
#define LC2                           605
#define LATC3                         606
#define LC3                           607
#define LATC4                         608
#define LC4                           609
#define LATC5                         610
#define LC5                           611
#define LATC6                         612
#define LC6                           613
#define LATC7                         614
#define LC7                           615
#define LATD                          616
#define LATD0                         617
#define LD0                           618
#define LATD1                         619
#define LD1                           620
#define LATD2                         621
#define LD2                           622
#define LATD3                         623
#define LD3                           624
#define LATD4                         625
#define LD4                           626
#define LATD5                         627
#define LD5                           628
#define LATD6                         629
#define LD6                           630
#define LATD7                         631
#define LD7                           632
#define LATE                          633
#define LATE0                         634
#define LE0                           635
#define LATE1                         636
#define LE1                           637
#define LATE2                         638
#define LE2                           639
#define ALRMVALL                      640
#define ALRMVALH                      641
#define ALRMRPT                       642
#define ARPT0                         643
#define ARPT                          644
#define ARPT1                         645
#define ARPT2                         646
#define ARPT3                         647
#define ARPT4                         648
#define ARPT5                         649
#define ARPT6                         650
#define ARPT7                         651
#define ALRMCFG                       652
#define ALRMPTR                       653
#define ALRMPTR0                      654
#define ALRMPTR1                      655
#define AMASK0                        656
#define AMASK                         657
#define AMASK1                        658
#define AMASK2                        659
#define AMASK3                        660
#define CHIME                         661
#define ALRMEN                        662
#define TRISA                         663
#define TRISA0                        664
#define TRISA1                        665
#define TRISA2                        666
#define TRISA3                        667
#define TRISA5                        668
#define TRISA6                        669
#define TRISA7                        670
#define TRISB                         671
#define TRISB0                        672
#define TRISB1                        673
#define TRISB2                        674
#define TRISB3                        675
#define TRISB4                        676
#define TRISB5                        677
#define TRISB6                        678
#define TRISB7                        679
#define TRISC                         680
#define TRISC0                        681
#define TRISC1                        682
#define TRISC2                        683
#define TRISC3                        684
#define TRISC4                        685
#define TRISC5                        686
#define TRISC6                        687
#define TRISC7                        688
#define TRISD                         689
#define TRISD0                        690
#define TRISD1                        691
#define TRISD2                        692
#define TRISD3                        693
#define TRISD4                        694
#define TRISD5                        695
#define TRISD6                        696
#define TRISD7                        697
#define TRISE                         698
#define TRISE0                        699
#define TRISE1                        700
#define TRISE2                        701
#define T3GCON                        702
#define T3GSS0                        703
#define T3GSS1                        704
#define T3GVAL                        705
#define T3GGO                         706
#define T3DONE                        707
#define T3GGO_T3DONE                  708
#define T3GSPM                        709
#define T3GTM                         710
#define T3GPOL                        711
#define TMR3GE                        712
#define RTCVALL                       713
#define RTCVALH_WAITE0                714
#define RTCVALH                       715
#define RTCVALH_WAITE1                716
#define RTCVALH_WAITM0                717
#define RTCVALH_WAITM1                718
#define RTCVALH_WAITM2                719
#define RTCVALH_WAITM3                720
#define RTCVALH_WAITB0                721
#define RTCVALH_WAITB1                722
#define T1GCON                        723
#define T1GSS0                        724
#define T1GSS1                        725
#define T1GVAL                        726
#define T1DONE                        727
#define T1GGO_T1DONE                  728
#define T1GGO                         729
#define T1GSPM                        730
#define T1GTM                         731
#define T1GPOL                        732
#define TMR1GE                        733
#define OSCTUNE                       734
#define TUN0                          735
#define TUN                           736
#define TUN1                          737
#define TUN2                          738
#define TUN3                          739
#define TUN4                          740
#define TUN5                          741
#define PLLEN                         742
#define INTSRC                        743
#define RCSTA2                        744
#define RCD82                         745
#define RX9D2                         746
#define RCSTA2_RX9D                   747
#define OERR2                         748
#define RCSTA2_OERR                   749
#define FERR2                         750
#define RCSTA2_FERR                   751
#define ADDEN2                        752
#define RCSTA2_ADDEN                  753
#define RCSTA2_CREN                   754
#define CREN2                         755
#define SREN2                         756
#define RCSTA2_SREN                   757
#define RC92                          758
#define RC8_92                        759
#define RCSTA2_RX9                    760
#define RX92                          761
#define RCSTA2_SPEN                   762
#define SPEN2                         763
#define PIE1                          764
#define TMR1IE                        765
#define TMR2IE                        766
#define CCP1IE                        767
#define SSP1IE                        768
#define SSPIE                         769
#define TXIE                          770
#define TX1IE                         771
#define RC1IE                         772
#define RCIE                          773
#define ADIE                          774
#define PSPIE                         775
#define PMPIE                         776
#define PIR1                          777
#define TMR1IF                        778
#define TMR2IF                        779
#define CCP1IF                        780
#define SSPIF                         781
#define SSP1IF                        782
#define TXIF                          783
#define TX1IF                         784
#define RCIF                          785
#define RC1IF                         786
#define ADIF                          787
#define PSPIF                         788
#define PMPIF                         789
#define IPR1                          790
#define TMR1IP                        791
#define TMR2IP                        792
#define CCP1IP                        793
#define SSPIP                         794
#define SSP1IP                        795
#define TX1IP                         796
#define TXIP                          797
#define RCIP                          798
#define RC1IP                         799
#define ADIP                          800
#define PMPIP                         801
#define PSPIP                         802
#define PIE2                          803
#define CCP2IE                        804
#define TMR3IE                        805
#define LVDIE                         806
#define BCL1IE                        807
#define BCLIE                         808
#define CM1IE                         809
#define CMIE                          810
#define CM2IE                         811
#define OSCFIE                        812
#define PIR2                          813
#define CCP2IF                        814
#define TMR3IF                        815
#define LVDIF                         816
#define BCL1IF                        817
#define BCLIF                         818
#define CM1IF                         819
#define CMIF                          820
#define CM2IF                         821
#define OSCFIF                        822
#define IPR2                          823
#define CCP2IP                        824
#define TMR3IP                        825
#define LVDIP                         826
#define BCLIP                         827
#define BCL1IP                        828
#define CM1IP                         829
#define CM2IP                         830
#define CMIP                          831
#define OSCFIP                        832
#define PIE3                          833
#define RTCCIE                        834
#define RXB0IE                        835
#define RXBNIE                        836
#define TMR3GIE                       837
#define RXB1IE                        838
#define CTMUIE                        839
#define TXB0IE                        840
#define TMR4IE                        841
#define TXB1IE                        842
#define TXB2IE                        843
#define TXBNIE                        844
#define TX2IE                         845
#define RC2IE                         846
#define BCL2IE                        847
#define SSP2IE                        848
#define PIR3                          849
#define RTCCIF                        850
#define RXBNIF                        851
#define TMR3GIF                       852
#define CTMUIF                        853
#define TMR4IF                        854
#define TXBNIF                        855
#define TX2IF                         856
#define RC2IF                         857
#define BCL2IF                        858
#define SSP2IF                        859
#define IPR3                          860
#define RTCCIP                        861
#define TMR3GIP                       862
#define RXBNIP                        863
#define CTMUIP                        864
#define TMR4IP                        865
#define TX2IP                         866
#define TXBNIP                        867
#define RC2IP                         868
#define BCL2IP                        869
#define SSP2IP                        870
#define EECON1                        871
#define WR                            872
#define WREN                          873
#define WRERR                         874
#define FREE                          875
#define WPROG                         876
#define EECON2                        877
#define TXSTA2                        878
#define TX9D2                         879
#define TXSTA2_TX9D                   880
#define TXD82                         881
#define TRMT2                         882
#define TXSTA2_TRMT                   883
#define BRGH2                         884
#define TXSTA2_BRGH                   885
#define SENDB2                        886
#define TXSTA2_SENDB                  887
#define TXSTA2_SYNC                   888
#define SYNC2                         889
#define TXEN2                         890
#define TXSTA2_TXEN                   891
#define TX8_92                        892
#define TX92                          893
#define TXSTA2_TX9                    894
#define TXSTA2_CSRC                   895
#define CSRC2                         896
#define TXREG2                        897
#define RCREG2                        898
#define SPBRG2                        899
#define RCSTA1                        900
#define RCSTA1_RX9D                   901
#define RX9D1                         902
#define RCD8                          903
#define RCSTA1_OERR                   904
#define OERR1                         905
#define RCSTA1_FERR                   906
#define FERR1                         907
#define RCSTA1_ADDEN                  908
#define ADDEN1                        909
#define ADEN                          910
#define RCSTA1_CREN                   911
#define CREN1                         912
#define SRENA                         913
#define SREN1                         914
#define RCSTA1_SREN                   915
#define RC8_9                         916
#define RCSTA1_RX9                    917
#define nRC8                          918
#define NOT_RC8                       919
#define RC9                           920
#define RX91                          921
#define RCSTA1_SPEN                   922
#define SPEN1                         923
#define TXSTA1                        924
#define TX9D1                         925
#define TXSTA1_TX9D                   926
#define TXD8                          927
#define TRMT1                         928
#define TXSTA1_TRMT                   929
#define BRGH1                         930
#define TXSTA1_BRGH                   931
#define TXSTA1_SENDB                  932
#define SENDB1                        933
#define TXSTA1_SYNC                   934
#define SYNC1                         935
#define TXEN1                         936
#define TXSTA1_TXEN                   937
#define TX91                          938
#define TX8_9                         939
#define NOT_TX8                       940
#define nTX8                          941
#define TXSTA1_TX9                    942
#define TXSTA1_CSRC                   943
#define CSRC1                         944
#define TXREG1                        945
#define RCREG1                        946
#define SPBRG1                        947
#define CTMUICON                      948
#define IRNG                          949
#define IRNG0                         950
#define IRNG1                         951
#define ITRIM0                        952
#define ITRIM                         953
#define ITRIM1                        954
#define ITRIM2                        955
#define ITRIM3                        956
#define ITRIM4                        957
#define ITRIM5                        958
#define CTMUCONL                      959
#define EDG1STAT                      960
#define EDG2STAT                      961
#define EDG1SEL                       962
#define EDG1SEL0                      963
#define EDG1SEL1                      964
#define EDG1POL                       965
#define EDG2SEL0                      966
#define EDG2SEL                       967
#define EDG2SEL1                      968
#define EDG2POL                       969
#define CTMUCONH                      970
#define CTTRIG                        971
#define IDISSEN                       972
#define EDGSEQEN                      973
#define EDGEN                         974
#define TGEN                          975
#define CTMUSIDL                      976
#define CTMUEN                        977
#define CCP2CON                       978
#define CCP2M                         979
#define CCP2M0                        980
#define CCP2M1                        981
#define CCP2M2                        982
#define CCP2M3                        983
#define DC2B                          984
#define DC2B0                         985
#define CCP2Y                         986
#define DC2B1                         987
#define CCP2X                         988
#define P2M                           989
#define P2M0                          990
#define P2M1                          991
#define CCPR2L                        992
#define CCPR2H                        993
#define ECCP2DEL                      994
#define ECCP2DEL_P2DC0                995
#define P2DC                          996
#define ECCP2DEL_P2DC1                997
#define ECCP2DEL_P2DC2                998
#define ECCP2DEL_P2DC3                999
#define ECCP2DEL_P2DC4                1000
#define ECCP2DEL_P2DC5                1001
#define ECCP2DEL_P2DC6                1002
#define P2RSEN                        1003
#define PSS2BD                        1004
#define PSS2BD0                       1005
#define PSS2BD1                       1006
#define PSS2AC0                       1007
#define PSS2AC                        1008
#define PSS2AC1                       1009
#define ECCP2AS0                      1010
#define ECCP2AS                       1011
#define ECCP2AS1                      1012
#define ECCP2AS2                      1013
#define ECCP2ASE                      1014
#define PSTR2CON                      1015
#define PSTR2CON_STRA                 1016
#define P2DC02                        1017
#define STRA2                         1018
#define P2DC0CON                      1019
#define PSTR2CON_P2DC0                1020
#define STRB2                         1021
#define P2DC12                        1022
#define PSTR2CON_STRB                 1023
#define PSTR2CON_P2DC1                1024
#define P2DC1CON                      1025
#define PSTR2CON_STRC                 1026
#define STRC2                         1027
#define PSTR2CON_P2DC2                1028
#define P2DC22                        1029
#define P2DC2CON                      1030
#define P2DC32                        1031
#define STRD2                         1032
#define PSTR2CON_STRD                 1033
#define P2DC3CON                      1034
#define PSTR2CON_P2DC3                1035
#define P2DC4CON                      1036
#define STRSYNC2                      1037
#define PSTR2CON_STRSYNC              1038
#define PSTR2CON_P2DC4                1039
#define P2DC42                        1040
#define P2DC52                        1041
#define P2DC5CON                      1042
#define PSTR2CON_P2DC5                1043
#define P2DC6CON                      1044
#define CMPL02                        1045
#define PSTR2CON_P2DC6                1046
#define P2DC62                        1047
#define PSTR2CON_CMPL0                1048
#define CMPL12                        1049
#define PSTR2CON_CMPL1                1050
#define CCP1CON                       1051
#define CCP1M0                        1052
#define CCP1M                         1053
#define CCP1M1                        1054
#define CCP1M2                        1055
#define CCP1M3                        1056
#define CCP1Y                         1057
#define DC1B                          1058
#define DC1B0                         1059
#define CCP1X                         1060
#define DC1B1                         1061
#define P1M                           1062
#define P1M0                          1063
#define P1M1                          1064
#define CCPR1L                        1065
#define CCPR1H                        1066
#define ECCP1DEL                      1067
#define P1DC                          1068
#define P1DC0                         1069
#define P1DC1                         1070
#define P1DC2                         1071
#define P1DC3                         1072
#define P1DC4                         1073
#define P1DC5                         1074
#define P1DC6                         1075
#define P1RSEN                        1076
#define PSS1BD0                       1077
#define PSS1BD                        1078
#define PSS1BD1                       1079
#define PSS1AC                        1080
#define PSS1AC0                       1081
#define PSS1AC1                       1082
#define ECCP1AS                       1083
#define ECCP1AS0                      1084
#define ECCP1AS1                      1085
#define ECCP1AS2                      1086
#define ECCP1ASE                      1087
#define PSTR1CON                      1088
#define PSTR1CON_STRA                 1089
#define PSTR1CON_STRB                 1090
